; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p10---int100n150-m25---int100c110---s207---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level6 level48)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level6 level49)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level6 level50)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level6 level51)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level6 level52)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level6 level53)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level6 level54)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level6 level55)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level6 level56)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level6 level57)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level6 level58)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level6 level59)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level6 level60)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level6 level61)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level6 level62)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level6 level63)
(sum level57 level10 level67)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level6 level64)
(sum level58 level10 level68)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level16 level74)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level6 level65)
(sum level59 level10 level69)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level16 level75)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level6 level66)
(sum level60 level10 level70)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level16 level76)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level6 level67)
(sum level61 level10 level71)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level16 level77)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level6 level68)
(sum level62 level10 level72)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level16 level78)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level6 level69)
(sum level63 level10 level73)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level16 level79)
(sum level63 level22 level85)
(sum level63 level25 level88)
(sum level64 level6 level70)
(sum level64 level10 level74)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level16 level80)
(sum level64 level22 level86)
(sum level64 level25 level89)
(sum level65 level6 level71)
(sum level65 level10 level75)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level65 level16 level81)
(sum level65 level22 level87)
(sum level65 level25 level90)
(sum level66 level6 level72)
(sum level66 level10 level76)
(sum level66 level14 level80)
(sum level66 level15 level81)
(sum level66 level16 level82)
(sum level66 level22 level88)
(sum level66 level25 level91)
(sum level67 level6 level73)
(sum level67 level10 level77)
(sum level67 level14 level81)
(sum level67 level15 level82)
(sum level67 level16 level83)
(sum level67 level22 level89)
(sum level68 level6 level74)
(sum level68 level10 level78)
(sum level68 level14 level82)
(sum level68 level15 level83)
(sum level68 level16 level84)
(sum level68 level22 level90)
(sum level69 level6 level75)
(sum level69 level10 level79)
(sum level69 level14 level83)
(sum level69 level15 level84)
(sum level69 level16 level85)
(sum level69 level22 level91)
(sum level70 level6 level76)
(sum level70 level10 level80)
(sum level70 level14 level84)
(sum level70 level15 level85)
(sum level70 level16 level86)
(sum level71 level6 level77)
(sum level71 level10 level81)
(sum level71 level14 level85)
(sum level71 level15 level86)
(sum level71 level16 level87)
(sum level72 level6 level78)
(sum level72 level10 level82)
(sum level72 level14 level86)
(sum level72 level15 level87)
(sum level72 level16 level88)
(sum level73 level6 level79)
(sum level73 level10 level83)
(sum level73 level14 level87)
(sum level73 level15 level88)
(sum level73 level16 level89)
(sum level74 level6 level80)
(sum level74 level10 level84)
(sum level74 level14 level88)
(sum level74 level15 level89)
(sum level74 level16 level90)
(sum level75 level6 level81)
(sum level75 level10 level85)
(sum level75 level14 level89)
(sum level75 level15 level90)
(sum level75 level16 level91)
(sum level76 level6 level82)
(sum level76 level10 level86)
(sum level76 level14 level90)
(sum level76 level15 level91)
(sum level77 level6 level83)
(sum level77 level10 level87)
(sum level77 level14 level91)
(sum level78 level6 level84)
(sum level78 level10 level88)
(sum level79 level6 level85)
(sum level79 level10 level89)
(sum level80 level6 level86)
(sum level80 level10 level90)
(sum level81 level6 level87)
(sum level81 level10 level91)
(sum level82 level6 level88)
(sum level83 level6 level89)
(sum level84 level6 level90)
(sum level85 level6 level91)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l3)
(fuelcost level16 l0 l3)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level25 l1 l3)
(connected l1 l5)
(fuelcost level22 l1 l5)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level15 l2 l3)
(connected l3 l0)
(fuelcost level16 l3 l0)
(connected l3 l1)
(fuelcost level25 l3 l1)
(connected l3 l2)
(fuelcost level15 l3 l2)
(connected l3 l4)
(fuelcost level10 l3 l4)
(connected l3 l5)
(fuelcost level14 l3 l5)
(connected l4 l3)
(fuelcost level10 l4 l3)
(connected l4 l5)
(fuelcost level6 l4 l5)
(connected l5 l1)
(fuelcost level22 l5 l1)
(connected l5 l3)
(fuelcost level14 l5 l3)
(connected l5 l4)
(fuelcost level6 l5 l4)

(at t0 l1)
(fuel t0 level91)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l5)
(at p3 l0)
(at p4 l5)
(at p5 l3)
(at p6 l5)
(at p7 l3)
(at p8 l1)
(at p9 l5)
)

(:goal
(and
(at p0 l4)
(at p1 l3)
(at p2 l4)
(at p3 l2)
(at p4 l2)
(at p5 l4)
(at p6 l1)
(at p7 l4)
(at p8 l0)
(at p9 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 10
2. (drive t0 l1 l0 level75 level16 level91)
   deleted: (at t0 l1) (fuel t0 level91)
   added: (at t0 l0) (fuel t0 level75)
   goals met: 0 of 10
3. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 1 of 10
4. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 10
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 10
6. (drive t0 l0 l3 level59 level16 level75)
   deleted: (at t0 l0) (fuel t0 level75)
   added: (at t0 l3) (fuel t0 level59)
   goals met: 1 of 10
7. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 1 of 10
8. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 1 of 10
9. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 1 of 10
10. (drive t0 l3 l5 level45 level14 level59)
   deleted: (at t0 l3) (fuel t0 level59)
   added: (at t0 l5) (fuel t0 level45)
   goals met: 1 of 10
11. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 1 of 10
12. (load p4 t0 l5)
   deleted: (at p4 l5)
   added: (in p4 t0)
   goals met: 1 of 10
13. (load p6 t0 l5)
   deleted: (at p6 l5)
   added: (in p6 t0)
   goals met: 1 of 10
14. (load p9 t0 l5)
   deleted: (at p9 l5)
   added: (in p9 t0)
   goals met: 1 of 10
15. (drive t0 l5 l4 level39 level6 level45)
   deleted: (at t0 l5) (fuel t0 level45)
   added: (at t0 l4) (fuel t0 level39)
   goals met: 1 of 10
16. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 2 of 10
17. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 3 of 10
18. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 4 of 10
19. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 5 of 10
20. (drive t0 l4 l3 level29 level10 level39)
   deleted: (at t0 l4) (fuel t0 level39)
   added: (at t0 l3) (fuel t0 level29)
   goals met: 5 of 10
21. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 10
22. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 7 of 10
23. (drive t0 l3 l2 level14 level15 level29)
   deleted: (at t0 l3) (fuel t0 level29)
   added: (at t0 l2) (fuel t0 level14)
   goals met: 7 of 10
24. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 8 of 10
25. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 9 of 10
26. (drive t0 l2 l1 level8 level6 level14)
   deleted: (at t0 l2) (fuel t0 level14)
   added: (at t0 l1) (fuel t0 level8)
   goals met: 9 of 10
27. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 10 of 10
